src/cf/InformationRegisters/GDS_СоответствиеТСиПУПодразделению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_СоответствиеТСиПУПодразделению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПрицепа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_СоответствиеТСиПУПодразделению/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВернутьПодрасделениеТСпоПУ(ПараметрыПоиска) Экспорт
	
	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	
	НаборЗаписей = РегистрыСведений.GDS_СоответствиеТСиПУПодразделению.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Колонна.Установить(ПараметрыПоиска.Колонна);
	НаборЗаписей.Отбор.ТипТС.Установить(ПараметрыПоиска.ТипТС);
	
	Если ЗначениеЗаполнено(ПараметрыПоиска.ТипПрицепа) Тогда
		НаборЗаписей.Отбор.ТипПрицепа.Установить(ПараметрыПоиска.ТипПрицепа);
	КонецЕсли;
	
	НаборЗаписей.Отбор.ПУ.Установить(ПараметрыПоиска.ПУ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Подразделение = НаборЗаписей[0].Подразделение;
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
